---
kind: property
id: P:Autodesk.Revit.DB.PointOnEdge.LocationOnCurve
source: html/289281ed-9ee4-8277-0268-f2955c3362d6.htm
---
# Autodesk.Revit.DB.PointOnEdge.LocationOnCurve Property

The point location on curve.

## Syntax (C#)
```csharp
public PointLocationOnCurve LocationOnCurve { get; }
```